{"id": "17470", "title": "Bug 17470Lose list contents when searching from Java Browsing", "description": " Bug 17470Lose list contents when searching from Java Browsing When you search (eg.", "OB": " for references) from a method selected in the method listof java browsing perspective, you lose at a minimum the contents of the methodlist.This can happen in two ways:1. The first time you run the search, you lose the project, package, and typelist selections, but yet the contents of all these list remain.Note thismeans that although a package isn't selected, the classes for it are still inthe next list. The methods list always ends up empty, however.2. If you reselect everything and rerun the same search (note you still havethe previous same search result in the search results list), you lose allselections as in (1), but the packages, types, and methods list are now allempty.What is odd is that if I simply select an item from the search results list, Idon't lose selections or contents, so its not simply autoselection of thesearch result that's causing the selection/contents change.In fact, itappears that the selection is being changed early in the search process whilethe progress is still moving and before any results appear.", "EB": "", "SR": " The first time you run the search, you lose the project, package, and typelist selections, but yet the contents of all these list remain.Note thismeans that although a package isn't selected, the classes for it are still inthe next list. If you reselect everything and rerun the same search (note you still havethe previous same search result in the search results list), you lose allselections as in (1), but the packages, types, and methods list are now allempty.What is odd is that if I simply select an item from the search results list, Idon't lose selections or contents, so its not simply autoselection of thesearch result that's causing the selection/contents change.In fact, itappears that the selection is being changed early in the search process whilethe progress is still moving and before any results appear."}