{"id": "16179", "title": "Bug 16179[Wizards] Wizard API: confusion over notifying of pages being entered, left", "description": " Bug 16179[Wizards] Wizard API: confusion over notifying of pages being entered, left Its not clear what a wizard writer is supposed to do to for notification ofpage transition.This is important for complex wizards which have to compute expensiveinformation based on a previous page, or where it must compute somethingexpensive for availability of the next page.The goal is optimal delaying ofcomputing information and of setting page control state (e.g. setting input ona tree).This may just be a javadoc/doc issue, or may be an API improvement issue.I would understand if we were hesitant to change any API here since there arealready a lot of wizards written against the current API.At present the writer can do one of two things:1. supplement DialogPage.setVisible(boolean) Although the javadoc says you can supplement it, it feels like a hack to doso (I assumed it was wrong until I saw the javadoc and spoke with Randy).Perhaps its just because it looks more like a setter than a notification ofvisibility. The other trick is to override getNextPage().", "OB": " There are two problems here: the API isn't clear that its ok to compute information for the next page byoverriding this method.Its also not clear that you could dynimally computethe next page using this.The javadoc comment in the method in IWizardPageisn't clear, and the class javadoc for WizardPage doesn't list it in thesection titled \"Subclasses may override these methods if required:\" this method gets called a lot (e.g.", "EB": " I have a bit of concern that the framework may wish to distinguishnotification from setting of a field state.It would be clearer to have methods like:entering()leaving()which are more clearly there solely for notification.2. to determine if Next should beenabled).Optimal use would involve overriding other methods which by defaultsend it.The javadoc should at least say that if you override it to do realwork, you need to override other methods as well.This is indicative of aproblem in the framework though.For example, if the method was calledcomputeNextPage(), it would be clear that senders should minimize their use andthat implementors can rely on that.", "SR": ""}