{"id": "3963", "title": "Bug 3963Clean up the [Issues] in javadoc (1GF9P7T)", "description": "Bug 3963Clean up the [Issues] in javadoc (1GF9P7T) ]public void setDefaultClassPath(IClasspathEntry[] entries, boolean appendDefaultJRE) {==There's a setter but no getter. This is a designed. Remove the Issue comment.org.eclipse.jdt.ui.JavaUI[Issue: SelectionDialogs must be parented. ]@param parent the parent shell of the dialog to be createdpublic static SelectionDialog createMainTypeDialog(Shell parent, IRunnableContext cont...==This is a designed: we want to allow unparented dialogs. Remove the Issue comment. [Issue: Explain semantics of opening an editor on a class file. ]</p<p[Issue: Explain under which conditions it returns null, throws JavaModelException, or throws JavaModelException. ]</p@param element the input element; either a compilation unit(<codeICompilationUnit</code) or a class file (</codeIClassFile</code)@return the editor, or </codenull</code if wrong element type or opening failed@exception PartInitException if the editor could not be initialized@exception JavaModelException if this element does not exist or if an exception occurs while accessing its underlying resource /public static IEditorPart openInEditor(IJavaElement element) throws JavaModelException, PartInitException {==Better explanation would be good.Reveals the source range of the given source reference element in thegiven editor. ]</p<p[Issue: Explain what happens if the source reference is from some other compilation unit, editor is not open, etc. ]</ppublic static void revealInEditor(IEditorPart part, ISourceReference element) {==Better explanation would be good.PackageViewer// defensive code. Multithread issue?if (item.isDisposed())==Would write: // guard for thread safetyorremove the ?NOTES: ", "OB": "No checking is done if the editor displays a compilation unit orclass file that contains the given source reference.<p[Issue: Explain what is meant by that last sentence. ", "EB": "shell must not be null. ", "SR": "Search for Issues in our plugins and clean up.This was found for JDT:org.eclipse.jdt.ui.wizards.NewJavaProjectWizardPage[Issue: It is slightly unfortunate to make appeal to a preference in an APImethod but not expose that preference as API. "}