{"id": "19821", "title": "Bug 19821System Info does not show/list Features", "description": "Bug 19821System Info does not show/list Features Per the last go around: \"Please file another PR if support for additionaldiagnostics is required. \"The System Info content may need another pass.Based on the discussion in(http://dev.eclipse.org/bugs/showbug.cgi?id=19301) we may need to consider somerestructure to the order of the content as well as adding more information aboutthe active features.Points:1. ", "OB": "Given the default of 10, the probability that products will push this numbermuch higher (such as 100+ to ensure they have a full log), and the updatemanager UI change to show them in the reverse order so that the most recent isat the top:System Info may want to move the configuration change log to after the errorlog and reverse the order to be consistent with the UI rendering of the sameinformation.2.Product service may require both a granular and conceptual view of what isinstalled.Plugin details are granular.Features are conceptual.Visibilityto the active features, with version info, is available in both the Aboutfeatures dialog and the Update Manager perspective.This information must be in the system info, near/before the plugin details(or indented plugins under a feature (like fragments are shown for a plugin)would work too).3.Nit.The spaced line after each indented fragment for a plugin implies thatthere is a grouping of the plugins.This is false as the fragment existencetriggers the blank linkbut the implication drives confusion when trying tovisually parse the content. ", "EB": "If plugins were listed by featurethen blanks/separator's before thefeature would work.If not, then maybe the blank after a fragment should beremoved as the indentation would be enough and reduce the visual confusion.4.Trying to determine if more detail about features/plugins impacted by aconfiguration change is available.If it is, this would be requested as part ofthe system info content. ", "SR": ""}