{"id": "4676", "title": "Bug 4676[Navigator] Tree scroll bar out of sync with top item (1GEJYGD)", "description": "Bug 4676[Navigator] Tree scroll bar out of sync with top item (1GEJYGD) The scroll bar is also at thetop/position 0.When you click the scroll bar the tree gets in sync with the scroll bar andshowsthe first tree item as the top item (the launcher project).NOTES:McQ (01/06/2001 9:02:42 AM) Scrollbar needs to be forced to update its position. Is thisa Tree problem or an ITPUI bug?KR (6/1/01 11:39:31 AM)It's the treeonly happens on Linux.KR (6/1/01 2:02:13 PM)Note that this is only reproducable when there are no editorsopen.It seems that the selected item is the top item and that thescroll bar isset as if the top item from the last Eclipse session was stillthe top item.McQ (01/06/2001 4:18:41 PM) Re \"It's the treeonly happens on Linux. This could be a similar case.KR (6/4/01 11:42:26 AM)After debugging this for a while I noticed that a bunch ofviewers call Tree.getVerticalBar()to restore the old ui state. This automaticallysets the top index and the scroll bar selection to 10.Someone (PackageExplorerPart.restoreState) then gets thevertical scroll bar and sets itsselection to 9. ", "OB": "\": We have alreadyhad several caseswhere they assumed that by working with the scroll bar directlythey could getwidgets to position their contents, which works some places andnot others(and thus is not supported). This is one of the cases wherethis doesn't work.Tree.setSelection is called to select the previously selecteditem (at index 10). For some reason the Tree doesn't always updatethe top index accordingly.KR (6/4/01 12:30:28 PM)It seems that the Tree sometimes gets a selection event for theprogrammatic scroll bar selectionbut most of the time doesn't.McQ (05/06/2001 11:04:29 AM) No further action for June.McQ (26/06/2001 2:19:17 PM) Time to take another look at this. ", "EB": "", "SR": "The Tree scroll bar can get out of sync with the top item on Linux.To reproduce in Eclipse:1. Open a standard SWT development workspace with the UIMain launcher loaded(org.eclipse.core.launcher should be the first project in the tree).2. Expand the project to display the UIMain class and select it.3. Exit Eclipse and restart.UIMain is selected and the top item. "}