{"bug_id": "44529", "title": "Bug 44529RealmBase authorization via hasResourcePermission not fully servlet spec compliant", "description": "The authorization implementation in RealmBase, in the hasResourcePermission method is not fully servlet specification compliant. The spec (both 2.4 and 2.5) states:\"...A security constraint that does not contain an authorization constraint shall combine with authorization constraints that name or imply roles to allow unauthenticated access.The special case of an authorization constraint that names no roles shall combine with any other constraints to override their affects and cause access to be precluded....\"In Tomcat this works fine as long as there aren't weird (but legal!) combinations or securityconstraints on the same URLs.Example:<securityconstraint<webresourcecollection<urlpattern/someUrl/</urlpattern<httpmethodPOST</httpmethod</webresourcecollection<! no authconstraint, to allow everyone </securityconstraint<securityconstraint<webresourcecollection<urlpattern/someUrl/</urlpattern<httpmethodPOST</httpmethod</webresourcecollection<! no roles, to allow noone <authconstraint /</securityconstraint(if we ignore that this kind of configuration is pretty pointless,)the spec dictates that a POST to /someUrl/index.html should be denied access.Tomcat grants it. (both 5.5.23 and 6.0.14 do)Example 2:<securityconstraint<webresourcecollection<urlpattern/someUrl/</urlpattern<httpmethodPOST</httpmethod</webresourcecollection<! no roles, to allow noone <authconstraint /</securityconstraint<securityconstraint<webresourcecollection<urlpattern/someUrl/</urlpattern<httpmethodPOST</httpmethod</webresourcecollection<authconstraint<rolename</rolename</authconstraint</securityconstraintNow it gets interesting. In \"strict\" mode, access to /someUrl/index.html is denied (regardless of the web.xmlconfigured security roles and the roles the user has).In \"authonly\" mode, access is always granted, and in \"strict authonly\" mode access is granted if there are no web.xmlconfigured security roles.Now these modes are a Tomcat addition to the spec, but I feel access should have been denied in all modes, both to stay in line with the spec and to keep the behaviour predictable."}