{"id": "33474", "title": "Bug 33474bad source locations for declare error/warning", "description": "Bug 33474bad source locations for declare error/warning [Submitted on behalf of Adrian Colyer and Jim Hugunin] ... there's one thing in the weaver I couldn't solve tonight (Jim/Mik) : org.aspectj.weaver.Checker.match(..) is called when checking whether a declare warning /error pointcut matches a given shadow. I've patched it in AJDT by scanning the project for the first resource that ends in the given name and using that, which we will get away with for many projects. I couldn't find an easy way to fix it properly in the weaver.This is an issue with the weaver operating on bytecode, where the onlyinformation about the actual source file is the FILENAME attribute inthe .class file which just contains the final unqualified portion of thename.I can think of three solutions to this:1. Change the code for getSourceLocation to use the current package in orderto produce a more complete filename, i.e. figures/Point.java instead of justPoint.java.This should be a relatively straightforward and localized changeand is the only solution that would help the case of weaving into .jar files.2. Handle declare error and warning in a special pass that performs weaving onthe AST rather than the .class file.This is the only solution that will giveyou correct column information which can make these messages easier tounderstand, but it is a LOT of work.I'd recommend that you consider doing 1 in order to improve the quality ofyour hack in the shortterm.I plan to look at 2 as part of a final cleanupof the incremental compilation code before the candidate1 release.I thinkthat ultimately 3 is the right answer, but it would be a very large amount ofwork and could only happen post1.1. ", "OB": "If t does, a Message is created whose sourceLocation is shadow.getSourceLocation(). The implementation of getSourceLocation in BcelShadow returns the unqualified file name rather than the qualified one (e.g \"Point.java\" rather than \"org.eclipse.ajdt.demo/src/figures/Point.java\") which means that later on eclipse can't find the resource the marker is supposed to be attached to. ", "EB": "", "SR": "Pass some additional information from the eclipse compiler phase to thebytecode weaver to let it know the actual source locations of files.Thiscould give you the actual source file, but is a crosscutting change that wouldaffect a lot of the system.3. "}